# 1) ვისწავლეთ:
# integer - მონაცემთა ტიპი პროგრამირებაში, რომელიც წარმოადგენს მთელ რიცხვებს.მაგ: -5, 0, 10...
# string - მონაცემთა ტიპი, რომელიც გამოიყენება ტექსტის შესანახად.მაგ: "Hello world".
# float - მონაცემთა ტიპი პროგრამირებაში, რომელიც გამოიყენება ათწილადი რიცხვების შესანახად.მაგ: 10.5, 38.04...
# boolean - მონაცემთა ტიპი პროგრამირებაში, რომელიც ინახავს მხოლოდ ორ შესაძლო მნიშვნელობას: True და False.

# თქვენი დავალება იქნება, რომ ყველა განიხილოთ რა რა არის, როგორ და რისთვის გამოიყენება და მოიყვანოთ ამ მონაცემების მაგალითები


# 2) ახსენით რა არის კონკატენაცია (concatenation)

# სტრინგების შეერთება



# 3) ახსენით რატომ არ შეგვიძლია გავაკეთოთ მათემატიკური ოპერაცია ისეთ რიცხვებზე რომლებიც არის ჩასმული ბრჭყალებში

#რადგან ისინი უკვე string'ებია და არა integer'ი.