# 1) ვისწავლეთ:
# integer - ყველა დადებითი და უარყოფითი რიცხვები.მაგ: -5, 0, 10...
# string - ყველა ის მონაცემი რომელიც მოქცეულია ბრჭყალებში.მაგ: "Hello world".
# float - ყველა ათწილადური რიცხვი.მაგ: 10.5, 38.04...
# boolean - True და False.

# თქვენი დავალება იქნება, რომ ყველა განიხილოთ რა რა არის, როგორ და რისთვის გამოიყენება და მოიყვანოთ ამ მონაცემების მაგალითები


# 2) ახსენით რა არის კონკატენაცია (concatenation)

# სტრინგების შეერთება



# 3) ახსენით რატომ არ შეგვიძლია გავაკეთოთ მათემატიკური ოპერაცია ისეთ რიცხვებზე რომლებიც არის ჩასმული ბრჭყალებში

#რადგან ისინი უკვე string'ებია და არა integer'ი.