# 2) შექმენით 10 ელემენტიანი list'ი და კომენტარის სახით დანომრეთ (მიუწერეთ ინდექსები). შემდეგ კი უბრალოდ გამოიტანეთ ეკრანზე.

# 3) პირველ დავალებაში შექმნილი List'იდან გამოიტანეთ პირველი სამი, ბოლო სამი და შუა 4 დადებითი ინდექსებით. (slicing)

# 4) პირველ დავალებაში შექმნილი List'იდან გამოიტანეთ პირველი სამი, ბოლო სამი და შუა 4 უარყოფითი ინდექსებით. (slicing)

nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

print(nums)

print(nums[:3])
print(nums[3 :7])
print(nums[7 :10])

print(nums[:-7])
print(nums[-7 :-3])
print(nums[-3 :])

# 5) შექმენით სტრინგი და შეატრიალეთ მისი სიმბოლოები ანუ თუ თავიდან იქნებოდა "Hello" გახდეს "olleH"

word = 'Hello'

print(word[:: -1])