# 1) შექმენით ცვლადი, სახელად points, რომელიც თავიდან უდრის 50, შემდეგ დაა-update-ეთ ამ ცვლადის მნიშვნელობა, რამოდენიმეჯერ. საბოლოოდ კი დაპრინტეთ ეს ცვლადი

point = 50
point = 54
point = 32
point = 75
point = 14
print(point)

# 2) გაასწორეთ შემდეგი კოდი:

age1 = 156
print(age1)

# 3) დაწერეთ პროგრამა, რომელიც შეიცავს ორ integer ტიპის ცვლადს (მაგალითად, a და b), შემდეგ გამოიანგარიშეთ ამ ცვლადების ჯამი, სხვაობა, ნამრავლი და განაყოფი.

a = 16
b = 4

print(a + b)
print(a - b)
print(a * b)
print(a / b)

# 4) დაწერეთ კოდი შეცდომებით და ქვემოთ მიუწერეთ მისი სწორი ვერსია.

#არასწორი:
#name = Nikolozi;
#print("name")

#გასწორებული
name = "Nikoloz"
print(name)